# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
a = ['снег', 4, 5.23, True]
a.insert(1, 'идёт')
a.insert(3, 'дня')

print((type(a[0])), (type(a[1])), (type(a[2])), (type(a[3])), (type(a[4])), (type(a[5])))
print(a)
